package util;

import java.net.InetAddress;

/*Інтерфейс, що містить методи для отримання адреси
* комп'ютера, до якого необхідно підключитись та
* для отримання імені даного комп'ютера(в нашому випадку
* просто нікнейм для чату)
* Чому користуємось інтерфейсом? Мені, наприклад, при написанні
* цієї програми було незручно брати необхідні дані з
* текстових файлів, тому я брав їх із класу, що реалізує такий
* самий інтерфейс, а самі дані жорстко прописані в коді. Це було
* зручно для написання і тестування, але потім для того щоб чат
* робив на двох різних комп'ютерах, необхідно було б на другому
* компі переписувати дані всередині цього класу і заново компілювати
* і збирати прогу, що не є зручно*/
public interface DataProvider {
    InetAddress getAddress();
    String getName();
}
